In [1]:
#it imports the Pandas library
import pandas as pd

In [2]:
#checks the pandas version installed
print(pd.__version__)

1.5.3

Pandas Series Practice

In [3]:
#creating a series from the list
list1 = [0,1,2,3,4] #creates a list 
s1 = pd.Series(list1) #converts the list into series along with index numbers
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [4]:
list2 = [2,5,8,7,9] #creates a list 2
index_order = [1,2,3,4,5] #Another list which represents the index numbers in the series for the list2
s2 = pd.Series(list2, index=index_order) #converts the list to Series and assigns the index_order
s2

1    2
2    5
3    8
4    7
5    9
dtype: int64

In [7]:
#create series from numpy random array
import numpy as np #imports NUMPY library
Random_Array = np.random.rand(6) #creates a random array of 6 numbers
index_order = ['a','b','c','d','e','f',] #creates index names
s3 = pd.Series(Random_Array, index=index_order) #converts the numpy random array to series and assigns the index names
s3

a    0.598394
b    0.129674
c    0.111984
d    0.485597
e    0.303274
f    0.692216
dtype: float64

In [3]:
#create series from dictionary
import pandas as pd
dictionary = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5,} #it creates a dictionary
series =  pd.Series(dictionary)
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
#modify the index of series
print(series)
series.index = ['A', 'B', 'C', 'D', 'E'] # it will modify the index from small to capital alphabets
print("the modified indexes of Series are: ")
series

A    1
B    2
C    3
D    4
E    5
dtype: int64
the modified indexes of Series are:

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [12]:
#slicing
a = series[:3]
a

A    1
B    2
C    3
dtype: int64

In [18]:
#Append
import numpy as np
import pandas as pd
array = np.random.rand(5)
s3 = pd.Series(array)
s_append = s3.append(series)
s_append

C:\Users\muham\AppData\Local\Temp\ipykernel_10876\85529699.py:6: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s_append = s3.append(series)

0    0.799034
1    0.498335
2    0.408384
3    0.758694
4    0.655967
A    1.000000
B    2.000000
C    3.000000
D    4.000000
E    5.000000
dtype: float64

In [22]:
s_append.drop('E')

0    0.799034
1    0.498335
2    0.408384
3    0.758694
4    0.655967
A    1.000000
B    2.000000
C    3.000000
D    4.000000
dtype: float64

In [24]:
#Series Operations
#addition
#multiplication
#subtraction
#division
list1 = [0,1,2,3,4,5,7]
list2 = [6,7,8,9,5]
s1 = pd.Series(list2)
s1

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [25]:
s2 = pd.Series(list1)
s2

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [26]:
s2.add(s1) #addition of two series

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [27]:
s2.sub(s1) #subtraction of two series

0   -6.0
1   -6.0
2   -6.0
3   -6.0
4   -1.0
5    NaN
6    NaN
dtype: float64

In [28]:
s2.mul(s1) #multiplication of two series

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [29]:
s2.div(s1) #division of two series

0    0.000000
1    0.142857
2    0.250000
3    0.333333
4    0.800000
5         NaN
6         NaN
dtype: float64

In [34]:
#Median, Mean, Max and Min
print("Median: ", s2.median()) #Finds Median: The middle value
print("Mean: ", s2.mean()) #finds Mean: The average value
print("Max: ", s2.max())
print("Min: ", s2.min())

Median:  3.0
Mean:  3.142857142857143
Max:  7
Min:  0

DataFrame Practice

In [5]:
#create DataFrame
import pandas as pd
import numpy as np
dates = pd.date_range('today', periods=6) #define time sequence as index
array = np.random.rand(6,4)
columns = ['A', 'B', 'C', 'D']
df1 = pd.DataFrame(array, index=dates, columns=columns)
df1

                                   A         B         C         D
2023-03-23 15:16:47.615818  0.728888  0.740147  0.012369  0.671515
2023-03-24 15:16:47.615818  0.980125  0.805356  0.599942  0.260171
2023-03-25 15:16:47.615818  0.554296  0.200333  0.947382  0.769525
2023-03-26 15:16:47.615818  0.194115  0.974227  0.946919  0.258461
2023-03-27 15:16:47.615818  0.658472  0.014446  0.754611  0.641174
2023-03-28 15:16:47.615818  0.811132  0.861608  0.633445  0.061065

In [6]:
dic = {'Name': ['Nauman', 'Asad', 'Luqman', 'Abbas'],
    'Age': [21,19,21,19],
    'Gender': ['Male','Male', 'Male', 'Male']}
index = [1,2,3,4]
df = pd.DataFrame(dic, index=index)
df

     Name  Age Gender
1  Nauman   21   Male
2    Asad   19   Male
3  Luqman   21   Male
4   Abbas   19   Male

In [7]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [9]:
df.head(3) # shows the top 3 records

     Name  Age Gender
1  Nauman   21   Male
2    Asad   19   Male
3  Luqman   21   Male

In [10]:
df.tail(3) #shows the last 3 records

     Name  Age Gender
2    Asad   19   Male
3  Luqman   21   Male
4   Abbas   19   Male

In [11]:
df.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [12]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [13]:
df.values

array([['Nauman', 21, 'Male'],
       ['Asad', 19, 'Male'],
       ['Luqman', 21, 'Male'],
       ['Abbas', 19, 'Male']], dtype=object)

In [14]:
df.describe()

             Age
count   4.000000
mean   20.000000
std     1.154701
min    19.000000
25%    19.000000
50%    20.000000
75%    21.000000
max    21.000000

In [15]:
df.T

             1     2       3      4
Name    Nauman  Asad  Luqman  Abbas
Age         21    19      21     19
Gender    Male  Male    Male   Male

In [16]:
df.sort_values(by='Age')

     Name  Age Gender
2    Asad   19   Male
4   Abbas   19   Male
1  Nauman   21   Male
3  Luqman   21   Male

In [20]:
#slicing DataFrame
df.sort_values(by='Age')[:2]

    Name  Age Gender
2   Asad   19   Male
4  Abbas   19   Male

In [21]:
#query DataFrame by tag
df[['Name', 'Age']]

     Name  Age
1  Nauman   21
2    Asad   19
3  Luqman   21
4   Abbas   19

In [25]:
#df = df1.copy()
df.isnull()

    Name    Age  Gender
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False

In [28]:
df.loc[3, 'Age']=20
df

     Name  Age Gender
1  Nauman   21   Male
2    Asad   19   Male
3  Luqman   20   Male
4   Abbas   19   Male

In [30]:
df[['Age']].mean()

Age    19.75
dtype: float64

In [31]:
df[['Age']].sum()

Age    79
dtype: int64